<template>
  <div>
    <div class="post-card">
        <img :src="require(`${img}`)"  class="card-img post-card-img" alt="...">
        <div class="card-name">{{name}}</div>
    </div>
    <article class="post-content">
        <div class="post-header">
            <div>{{name}}的《零規則》閱讀心得</div>
        </div>
        <div class="post-info">
            {{time}}
        </div>
        <div class="post-img">
            <img src="./book1.jpg" class="card-img" alt="...">
        </div>
        <div class="post-review">
          <slot>
            {{`最近社群上「后翼棄兵」這部 Netflix 的劇又很紅，剛好有興趣去看了他們最近的新書零規則，覺得 Netflix 這家公司不簡單，雖然我常覺得它們的劇都很芭樂加政治正確，但都能造成一時的現象級討論，而且每隔一段時間就會重複發生，已經不能簡單稱之為矇，其他串流平台怎就沒那麼常矇到？   
            
            讀《零規則》一書，這家公司的企業文化：印象很深刻的幾個點，寧願多出點錢聘創造力頂尖人才，一個頂尖人才勝過十個普通人才；不給績效獎金直接薪水開到市場行情，因為頂尖人才不管拿多少錢都會發揮最佳表現；只要發現不等員工提隨時自動幫員工薪水調到他該有的市場行情，鼓勵員工去面試重點要告訴公司其他人開給他多少讓公司有機會提高他的薪水；想休多少假自己決定，而且主管會帶頭示範常常休假，不用報帳自己判斷，但以讓公司更好為原則；公司任何一個職等的人都會在公開場合提出他的任何質疑，而且主管要大力稱讚這種行為。           
            
            其實 Netflix 核心文化簡單來說就是找到最頂尖的人才，然後讓公司抱持絕對的透明和誠實，放權給所有人自己做決策，因為它們相信這個產業中比起預防錯誤，更重要的是不斷找到新的更大的創新點。這本身很好看，百分百推薦去看，書中很多的故事很實際的舉例以上這些簡單的法則是如何被落實，又是為什麼 Netflix 從員工真實的反饋中看到效果並優化。印象很深刻一句話，「質疑上司沒有任何問題，但公司請你來，你有想法卻沒有說出來就是對公司不忠。」會讓人滿嚮往可以在這種公司工作的。            
            
            我過去工作的公司往往是主管緊盯著你每個一舉一動避免你犯錯（書中的例子是創辦人到新加坡分部看到執行方向完全錯誤，但他當下沒反對，而是回去後重新檢討，是否沒有對下所有人講清楚大方向，才造成底下人執行方向上的判斷失誤），然後你的想法事實上也沒人在乎，你也無權做任何重要決策並為之負責。這本書也有打破我之前對 Netflix 印象，鐵血無情的傭兵制度公司，公司內無情淘汰不夠優秀的人。事實上，書中很多 Netflix 員工的故事指出雖然壓力大了，可是卻感到更被信任，也覺得這個環境更利於發揮影響力，而且實際上流動率更低。          
            
            這跟我上本看到的書《教練》呼應，都強調一個概念：公司不是大家庭，更像是一隻職業球隊。每個人在正確的時間點在正確的位置上共同團結努力奮鬥。但重點是要讓員工覺得自己是公司的一份子，它們才會自發性的去努力，高薪水只是基本，重點還是公司給予的信任，還有一個完全開放誠實的環境。如果要說兩者不同之處，教練是有點像是所到之處透過提點發揮影響力，Netflix 比較像是把比爾說的那些原則用更激進的方式變成公司的行事準則，像是誠實透明，教練一書的比爾有說他要給負面批評時會私下說，Netflix  則是推崇大家有任何意見調都可以當眾就講出來大家一起討論，但推崇的是帶著善意的批評，所以 Netflix 中採取的  360 度評量後來改成署名，因為公司內員工很多人都覺得匿名很怪，而且匿名反而會常收到沒建設性的批評，有建設性的批評通常是實事求是，然後舉例，並且說出具體覺得該怎麼做才好（然後避免使用抽象的諷刺）         
            
            以上講起來簡單，但實際上多數台灣的公司老闆會說公司風險是他在擔，當然不可能讓你決策，也沒那麼在乎你的意見，因為重要的是把你當工具人操作 SOP，偶爾可以聽你點意見但不要跟老闆不同，不過這種方式其實在犯錯風險極大的行業也是合理的，像是金融業或者科技業，但有些新創也這樣我就不太能理解就是了，可能真的可以推薦老闆去看看這本書。我相信多數情況下，人被當人看待的確會把事情做得比較好，Neflix 這間公司嘗試把公司每個員工嘗試當作成熟且平等的大人，甚至有可能因為某些原因開除你也會提早跟你講，讓你做好因應，不會最後一刻直接告知，這真的是我覺得挺好的。`}}
          </slot>
        </div>
    </article>  
  </div>
</template>

<script>
export default {
  name: "Post",
  props: ['img', 'name', 'time'],
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>
